## Data Input and Output Practice

### (Step1) Required Libraries to Install
* conda install sqlalchemy
* conda install lxml
* conda install html5lib
* conda install BeautifulSoup4

In [1]:
# Import necessary libraries
import pandas as pd

### How to read in a csv file

In [2]:
# Use pandas and .read_csv() method to read in csv file
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [3]:
# Create a dataframe in order to WRITE to a CSV file
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
# Write to csv file
df.to_csv('my_file_output', index=False)

In [5]:
pd.read_csv('my_file_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### How to read and write from excel files

In [6]:
# Received error so needed to install xlrd in terminal

In [7]:
# Read in excel files
pd.read_excel('Excel_Sample.xlsx', sheetname='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
# Write to a new Excel Workbook and specify the sheetname
df.to_excel('Excel_Sample_Practice.xlsx', sheet_name='New_Sheet')

### How to work with HTML

In [9]:
# Read in HTML URL 
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [10]:
# Investigate the type of data obtained -> we see it is a list and not dataframe
type(data)

list

In [12]:
# We need to cycle through list to find what we need
data[0].head(5)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","December 20, 2017"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","October 20, 2017"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","July 26, 2017"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

### How to work with SQL

In [14]:
# Import the create_engine method from the sqlalchemy module
from sqlalchemy import create_engine

In [15]:
# Create a simple SQL engine in memory
engine = create_engine('sqlite:///:memory:')

In [16]:
# Write dataframe to SQL
df.to_sql('my_table', engine)

In [18]:
# Read dataframe from SQL
sqldf = pd.read_sql('my_table', con=engine)
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15